# Ejemplo practicopara Pandas con DataFrames

## 1. Inspección inicial del DataFrame

In [1]:
# Importación de Librerias

import pandas as pd

In [2]:
# Crear un DataFrame a partir de un diccionario
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Lucia', 'Martha', 'Jorge', 'Sofia'],
    'Edad': [23, 35, 45, 25, 30, 28, 32],
    'Ciudad': ['CDMX', 'Guadalajara', 'Monterrey', 'CDMX', 'Puebla', 'CDMX', 'Guadalajara'],
    'Salario': [12000, 15000, 18000, 12500, 14000, 13000, 15500],
    'Departamento': ['Ventas', 'Marketing', 'Ventas', 'TI', 'TI', 'Marketing', 'Ventas']
}

In [3]:
df = pd.DataFrame(data)
df

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
1    Luis    35  Guadalajara    15000    Marketing
2  Carlos    45    Monterrey    18000       Ventas
3   Lucia    25         CDMX    12500           TI
4  Martha    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas

## 2. Estructura y resumen del DataFrame

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [5]:
df.describe()

            Edad       Salario
count   7.000000      7.000000
mean   31.142857  14285.714286
std     7.335498   2078.804602
min    23.000000  12000.000000
25%    26.500000  12750.000000
50%    30.000000  14000.000000
75%    33.500000  15250.000000
max    45.000000  18000.000000

In [6]:
# Muestra el tamaño del dtaframe

df.shape

(7, 5)

In [ ]:
# Numero de filas 0
#len(df)
df.shape[0]

7

In [ ]:
# Numero de columnas 1
df.shape[1]

5

In [10]:
# Muestra los tipos de datos de las columnas
df.dtypes

Nombre          object
Edad             int64
Ciudad          object
Salario          int64
Departamento    object
dtype: object

In [11]:
# Columnas
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Salario', 'Departamento'], dtype='object')

In [12]:
# indices
df.index

RangeIndex(start=0, stop=7, step=1)

## 3. Selección de columnas y filas

In [ ]:
# Selecciona una sola columna del DataFrame como una SERIE
df['Edad']

0    23
1    35
2    45
3    25
4    30
5    28
6    32
Name: Edad, dtype: int64

In [16]:
type(df['Edad'])

pandas.core.series.Series

In [17]:
# Lo muestra como una DataFrame
df[['Edad']]

   Edad
0    23
1    35
2    45
3    25
4    30
5    28
6    32

In [18]:
type(df[['Edad']])

pandas.core.frame.DataFrame

In [ ]:
# Muestra dos o más columnas
df[['Nombre', 'Salario']]

   Nombre  Salario
0     Ana    12000
1    Luis    15000
2  Carlos    18000
3   Lucia    12500
4  Martha    14000
5   Jorge    13000
6   Sofia    15500

## 4. Filtrado de filas

In [ ]:
# Filtrar todas las filas que la ciudad sea CDMX        (Expresión)
df['Ciudad'] == 'CDMX'

0     True
1    False
2    False
3     True
4    False
5     True
6    False
Name: Ciudad, dtype: bool

In [23]:
#                                                   (Estructura de filtro)
df[df['Ciudad'] == 'CDMX']

  Nombre  Edad Ciudad  Salario Departamento
0    Ana    23   CDMX    12000       Ventas
3  Lucia    25   CDMX    12500           TI
5  Jorge    28   CDMX    13000    Marketing

In [ ]:
#                                               (filtrar y mostrar especificos)
df[df['Ciudad'] == 'CDMX'][['Nombre','Salario']]

  Nombre  Salario
0    Ana    12000
3  Lucia    12500
5  Jorge    13000

In [27]:
# Crear copia
df_cdmx = df[df['Ciudad'] == 'CDMX']

In [28]:
df_cdmx[['Nombre','Salario']]

  Nombre  Salario
0    Ana    12000
3  Lucia    12500
5  Jorge    13000

In [ ]:
# Mostrar todas las filas de la CDMX y del departamento de TI      &
df[(df['Ciudad'] == 'CDMX') & (df['Departamento'] == 'TI')]

  Nombre  Edad Ciudad  Salario Departamento
3  Lucia    25   CDMX    12500           TI

In [32]:
# Mostrar todas las filas de la CDMX o del departamento de TI      |
df[(df['Ciudad'] == 'CDMX') | (df['Departamento'] == 'TI')]

   Nombre  Edad  Ciudad  Salario Departamento
0     Ana    23    CDMX    12000       Ventas
3   Lucia    25    CDMX    12500           TI
4  Martha    30  Puebla    14000           TI
5   Jorge    28    CDMX    13000    Marketing

## 5. Ordenar filas

In [ ]:
# Ordena de forma ascendente de forma fija
df.sort_values(by='Salario')

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marketing
4  Martha    30       Puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas

In [ ]:
# Ascendente (A-Z, 0-9)
df.sort_values(by='Salario', ascending=True)

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marketing
4  Martha    30       Puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas

In [37]:
# Ascendente (Z-A, 9-0)
df.sort_values(by='Salario', ascending=False)

   Nombre  Edad       Ciudad  Salario Departamento
2  Carlos    45    Monterrey    18000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
4  Martha    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

In [39]:
# Ordenar por el salario y la ciudad
df.sort_values(by=['Ciudad', 'Salario'], ascending=[True, False])

   Nombre  Edad       Ciudad  Salario Departamento
5   Jorge    28         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
2  Carlos    45    Monterrey    18000       Ventas
4  Martha    30       Puebla    14000           TI

## 6. Crear Nuevas Columnas

In [40]:
df['SalarioAnual'] = df['Salario'] * 12